pandas 라이브러리 호출

In [1]:
import pandas as pd     # pandas 라이브러리를 pd 이름으로 호출

# Series

In [2]:
prices = [1000, 1010, 1020]     # 주가를 담아놓은 리스트 생성

In [3]:
dates = pd.date_range('2019-05-01', periods=3)     # date_range 함수를 이용해 날짜 생성
dates

DatetimeIndex(['2019-05-01', '2019-05-02', '2019-05-03'], dtype='datetime64[ns]', freq='D')

https://pandas.pydata.org/pandas-docs/stable/generated/pandas.date_range.html

In [4]:
help(pd.date_range)

Help on function date_range in module pandas.core.indexes.datetimes:

date_range(start=None, end=None, periods=None, freq=None, tz=None, normalize=False, name=None, closed=None, **kwargs)
    Return a fixed frequency DatetimeIndex.

    Parameters
    ----------
    start : str or datetime-like, optional
        Left bound for generating dates.
    end : str or datetime-like, optional
        Right bound for generating dates.
    periods : integer, optional
        Number of periods to generate.
    freq : str or DateOffset, default 'D'
        Frequency strings can have multiples, e.g. '5H'. See
        :ref:`here <timeseries.offset_aliases>` for a list of
        frequency aliases.
    tz : str or tzinfo, optional
        Time zone name for returning localized DatetimeIndex, for example
        'Asia/Hong_Kong'. By default, the resulting DatetimeIndex is
        timezone-naive.
    normalize : bool, default False
        Normalize start/end dates to midnight before generating date range.
    name : str, default None
        Name of the resulting DatetimeIndex.
    closed : {None, 'left', 'right'}, optional
        Make the interval closed with respect to the given frequency to
        the 'left', 'right', or both sides (None, the default).
    **kwargs
        For compatibility. Has no effect on the result.

    Returns
    -------
    rng : DatetimeIndex

    See Also
    --------
    pandas.DatetimeIndex : An immutable container for datetimes.
    pandas.timedelta_range : Return a fixed frequency TimedeltaIndex.
    pandas.period_range : Return a fixed frequency PeriodIndex.
    pandas.interval_range : Return a fixed frequency IntervalIndex.

    Notes
    -----
    Of the four parameters ``start``, ``end``, ``periods``, and ``freq``,
    exactly three must be specified. If ``freq`` is omitted, the resulting
    ``DatetimeIndex`` will have ``periods`` linearly spaced elements between
    ``start`` and ``end`` (closed on both sides).

    To learn more about the frequency strings, please see `this link
    <http://pandas.pydata.org/pandas-docs/stable/timeseries.html#offset-aliases>`__.

    Examples
    --------
    **Specifying the values**

    The next four examples generate the same `DatetimeIndex`, but vary
    the combination of `start`, `end` and `periods`.

    Specify `start` and `end`, with the default daily frequency.

    >>> pd.date_range(start='1/1/2018', end='1/08/2018')
    DatetimeIndex(['2018-01-01', '2018-01-02', '2018-01-03', '2018-01-04',
                   '2018-01-05', '2018-01-06', '2018-01-07', '2018-01-08'],
                  dtype='datetime64[ns]', freq='D')

    Specify `start` and `periods`, the number of periods (days).

    >>> pd.date_range(start='1/1/2018', periods=8)
    DatetimeIndex(['2018-01-01', '2018-01-02', '2018-01-03', '2018-01-04',
                   '2018-01-05', '2018-01-06', '2018-01-07', '2018-01-08'],
                  dtype='datetime64[ns]', freq='D')

    Specify `end` and `periods`, the number of periods (days).

    >>> pd.date_range(end='1/1/2018', periods=8)
    DatetimeIndex(['2017-12-25', '2017-12-26', '2017-12-27', '2017-12-28',
                   '2017-12-29', '2017-12-30', '2017-12-31', '2018-01-01'],
                  dtype='datetime64[ns]', freq='D')

    Specify `start`, `end`, and `periods`; the frequency is generated
    automatically (linearly spaced).

    >>> pd.date_range(start='2018-04-24', end='2018-04-27', periods=3)
    DatetimeIndex(['2018-04-24 00:00:00', '2018-04-25 12:00:00',
                   '2018-04-27 00:00:00'],
                  dtype='datetime64[ns]', freq=None)

    **Other Parameters**

    Changed the `freq` (frequency) to ``'M'`` (month end frequency).

    >>> pd.date_range(start='1/1/2018', periods=5, freq='M')
    DatetimeIndex(['2018-01-31', '2018-02-28', '2018-03-31', '2018-04-30',
                   '2018-05-31'],
                  dtype='datetime64[ns]', freq='M')

    Multiples are allowed

    >>> pd.date_range(start='1/1/2018', periods=5, freq='3M')
    DatetimeIndex(['2018-01-31', '2018-04-30', '2018-07-31', '2018-10-31',
                   '2019-01-31'],
                  dtype='datetime64[ns]', freq='3M')

    `freq` can also be specified as an Offset object.

    >>> pd.date_range(start='1/1/2018', periods=5, freq=pd.offsets.MonthEnd(3))
    DatetimeIndex(['2018-01-31', '2018-04-30', '2018-07-31', '2018-10-31',
                   '2019-01-31'],
                  dtype='datetime64[ns]', freq='3M')

    Specify `tz` to set the timezone.

    >>> pd.date_range(start='1/1/2018', periods=5, tz='Asia/Tokyo')
    DatetimeIndex(['2018-01-01 00:00:00+09:00', '2018-01-02 00:00:00+09:00',
                   '2018-01-03 00:00:00+09:00', '2018-01-04 00:00:00+09:00',
                   '2018-01-05 00:00:00+09:00'],
                  dtype='datetime64[ns, Asia/Tokyo]', freq='D')

    `closed` controls whether to include `start` and `end` that are on the
    boundary. The default includes boundary points on either end.

    >>> pd.date_range(start='2017-01-01', end='2017-01-04', closed=None)
    DatetimeIndex(['2017-01-01', '2017-01-02', '2017-01-03', '2017-01-04'],
                  dtype='datetime64[ns]', freq='D')

    Use ``closed='left'`` to exclude `end` if it falls on the boundary.

    >>> pd.date_range(start='2017-01-01', end='2017-01-04', closed='left')
    DatetimeIndex(['2017-01-01', '2017-01-02', '2017-01-03'],
                  dtype='datetime64[ns]', freq='D')

    Use ``closed='right'`` to exclude `start` if it falls on the boundary.

    >>> pd.date_range(start='2017-01-01', end='2017-01-04', closed='right')
    DatetimeIndex(['2017-01-02', '2017-01-03', '2017-01-04'],
                  dtype='datetime64[ns]', freq='D')

In [5]:
pd.date_range('2018-12-01', '2018-12-31', freq='W-FRI')

DatetimeIndex(['2018-12-07', '2018-12-14', '2018-12-21', '2018-12-28'], dtype='datetime64[ns]', freq='W-FRI')

https://pandas.pydata.org/pandas-docs/stable/timeseries.html#timeseries-offset-aliases

In [6]:
s2 = pd.Series(prices)     # 인덱스를 지정하지 않은 Series
s2

0    1000
1    1010
2    1020
dtype: int64

In [7]:
s2[3] = 1030     # Series에 데이터 추가
s2

0    1000
1    1010
2    1020
3    1030
dtype: int64

In [16]:
# 주가를 데이터로, 날짜를 인덱스로 하는 Series 생성
s = pd.Series(prices, index=dates)     # pd.Series(데이터)
s

2019-05-01    1000
2019-05-02    1010
2019-05-03    1020
Freq: D, dtype: int64

In [17]:
s[pd.to_datetime('2019-05-04')] = 1030     # 인덱스를 이용한 데이터 추가
s

2019-05-01    1000
2019-05-02    1010
2019-05-03    1020
2019-05-04    1030
Freq: D, dtype: int64

In [18]:
s.index

DatetimeIndex(['2019-05-01', '2019-05-02', '2019-05-03', '2019-05-04'], dtype='datetime64[ns]', freq='D')

Series 데이터 조회

In [19]:
s[2]     # 배열 스타일로 데이터 추출

1020

In [20]:
s['2019-05-03']     # 인덱스를 이용한 데이터 추출

1020

# DataFrame

In [21]:
# 딕셔너리로부터 DataFrame 만들기
prices = {'A전자' : [1000, 1010, 1020],
          'B화학' : [2000, 2010, 2020],
          'C금융' : [3000, 3010, 3020]}
df1 = pd.DataFrame(prices)     # pd.DataFrame(데이터)
df1

    A전자   B화학   C금융
0  1000  2000  3000
1  1010  2010  3010
2  1020  2020  3020

In [22]:
df2 = pd.DataFrame(prices, index=dates)     # 인덱스가 있는 DataFrame
df2

             A전자   B화학   C금융
2019-05-01  1000  2000  3000
2019-05-02  1010  2010  3010
2019-05-03  1020  2020  3020

데이터 선택 - 인덱스 번호 이용

In [23]:
df2.iloc[0]     # 행 선택 - [0행, 생략]

A전자    1000
B화학    2000
C금융    3000
Name: 2019-05-01 00:00:00, dtype: int64

In [24]:
df2.iloc[:, 0]     # 열 선택 - [전체 행, 0열]

2019-05-01    1000
2019-05-02    1010
2019-05-03    1020
Freq: D, Name: A전자, dtype: int64

In [25]:
df2.iloc[0, 0]     # 행, 열 지정 - [0행, 0열]

1000

데이터 선택 - 레이블 이용

In [26]:
df2.loc['2019-05-01']   # ['2018-12-01'행, 생략]

A전자    1000
B화학    2000
C금융    3000
Name: 2019-05-01 00:00:00, dtype: int64

In [27]:
df2.loc[:, 'A전자']   # [모든 행, 'A전자'열]

2019-05-01    1000
2019-05-02    1010
2019-05-03    1020
Freq: D, Name: A전자, dtype: int64

In [28]:
df2.loc['2019-05-01', 'A전자']   # ['2018-12-01'행, 'A전자'열]

1000

또 다른 방법들 - 이렇게도 되는구나 라고 참고만 하세요

In [29]:
df2['A전자']     # 열 선택

2019-05-01    1000
2019-05-02    1010
2019-05-03    1020
Freq: D, Name: A전자, dtype: int64

In [30]:
df2.A전자     # df2['A전자']  와 동일

2019-05-01    1000
2019-05-02    1010
2019-05-03    1020
Freq: D, Name: A전자, dtype: int64

In [31]:
df2['A전자']['2019-05-01']   # df2['A전자']의 ['2018-12-01']행 선택

1000

In [32]:
df2.loc[:, 'A전자']['2019-05-01']

1000

데이터 추가

In [33]:
# DataFrame에 열 추가
df2['D엔터'] = [4000, 4010, 4020]     # 데이터프레임[열이름] = [데이터]
df2

             A전자   B화학   C금융   D엔터
2019-05-01  1000  2000  3000  4000
2019-05-02  1010  2010  3010  4010
2019-05-03  1020  2020  3020  4020

In [34]:
s

2019-05-01    1000
2019-05-02    1010
2019-05-03    1020
2019-05-04    1030
Freq: D, dtype: int64

In [35]:
# Series로 부터 DataFrame 열 추가  
df2['E텔레콤'] = s    # 데이터프레임[열이름] = [데이터]
df2

             A전자   B화학   C금융   D엔터  E텔레콤
2019-05-01  1000  2000  3000  4000  1000
2019-05-02  1010  2010  3010  4010  1010
2019-05-03  1020  2020  3020  4020  1020

어? s는 데이터값이 4개 있는데 왜 3개만 들어가지?

데이터프레임 확장

In [36]:
# 시리즈에 이름 붙이기
s.name = 'F소프트'   # 시리즈.name = '이름'
s

2019-05-01    1000
2019-05-02    1010
2019-05-03    1020
2019-05-04    1030
Freq: D, Name: F소프트, dtype: int64

In [37]:
# 데이터프레임끼리 합치기
df2 = pd.concat([df2, s], axis=1)   # pd.concat([데이터프레임A, 데이터프레임B], axis=방향)
# axis=1이면 열방향으로 확장, axis=0이면 행방향으로 확장
df2

               A전자     B화학     C금융     D엔터    E텔레콤  F소프트
2019-05-01  1000.0  2000.0  3000.0  4000.0  1000.0  1000
2019-05-02  1010.0  2010.0  3010.0  4010.0  1010.0  1010
2019-05-03  1020.0  2020.0  3020.0  4020.0  1020.0  1020
2019-05-04     NaN     NaN     NaN     NaN     NaN  1030

In [38]:
pd.concat([df2, s], axis=0)   # axis=1을 제대로 지정 못해 행방향으로 늘어나버림

               A전자     B화학     C금융     D엔터    E텔레콤    F소프트       0
2019-05-01  1000.0  2000.0  3000.0  4000.0  1000.0  1000.0     NaN
2019-05-02  1010.0  2010.0  3010.0  4010.0  1010.0  1010.0     NaN
2019-05-03  1020.0  2020.0  3020.0  4020.0  1020.0  1020.0     NaN
2019-05-04     NaN     NaN     NaN     NaN     NaN  1030.0     NaN
2019-05-01     NaN     NaN     NaN     NaN     NaN     NaN  1000.0
2019-05-02     NaN     NaN     NaN     NaN     NaN     NaN  1010.0
2019-05-03     NaN     NaN     NaN     NaN     NaN     NaN  1020.0
2019-05-04     NaN     NaN     NaN     NaN     NaN     NaN  1030.0

In [39]:
데이터프레임에다 사칙연산을 먹이면 데이터 전체에 일괄 적용 된다

SyntaxError: invalid syntax (<ipython-input-39-3b4050b2fe92>, line 1)

In [40]:
df2.iloc[0]

A전자     1000.0
B화학     2000.0
C금융     3000.0
D엔터     4000.0
E텔레콤    1000.0
F소프트    1000.0
Name: 2019-05-01 00:00:00, dtype: float64

In [41]:
df3 = df2.iloc[0]
df3 = df3 + 60
df3.name = pd.to_datetime('2019-05-07')
df3

A전자     1060.0
B화학     2060.0
C금융     3060.0
D엔터     4060.0
E텔레콤    1060.0
F소프트    1060.0
Name: 2019-05-07 00:00:00, dtype: float64

In [42]:
# 데이터프레임 행 확장
df2 = df2.append(df3)  # 데이터프레임A.append(데이터프레임B)
df2

               A전자     B화학     C금융     D엔터    E텔레콤    F소프트
2019-05-01  1000.0  2000.0  3000.0  4000.0  1000.0  1000.0
2019-05-02  1010.0  2010.0  3010.0  4010.0  1010.0  1010.0
2019-05-03  1020.0  2020.0  3020.0  4020.0  1020.0  1020.0
2019-05-04     NaN     NaN     NaN     NaN     NaN  1030.0
2019-05-07  1060.0  2060.0  3060.0  4060.0  1060.0  1060.0

In [43]:
df3 = df2.iloc[0] + 50
df3.name = pd.to_datetime('20190506')
df2 = df2.append(df3)
df2

               A전자     B화학     C금융     D엔터    E텔레콤    F소프트
2019-05-01  1000.0  2000.0  3000.0  4000.0  1000.0  1000.0
2019-05-02  1010.0  2010.0  3010.0  4010.0  1010.0  1010.0
2019-05-03  1020.0  2020.0  3020.0  4020.0  1020.0  1020.0
2019-05-04     NaN     NaN     NaN     NaN     NaN  1030.0
2019-05-07  1060.0  2060.0  3060.0  4060.0  1060.0  1060.0
2019-05-06  1050.0  2050.0  3050.0  4050.0  1050.0  1050.0

In [44]:
df2 = df2.sort_index(axis=0)     # 날짜 순으로 인덱스 재정렬
df2

               A전자     B화학     C금융     D엔터    E텔레콤    F소프트
2019-05-01  1000.0  2000.0  3000.0  4000.0  1000.0  1000.0
2019-05-02  1010.0  2010.0  3010.0  4010.0  1010.0  1010.0
2019-05-03  1020.0  2020.0  3020.0  4020.0  1020.0  1020.0
2019-05-04     NaN     NaN     NaN     NaN     NaN  1030.0
2019-05-06  1050.0  2050.0  3050.0  4050.0  1050.0  1050.0
2019-05-07  1060.0  2060.0  3060.0  4060.0  1060.0  1060.0

데이터 삭제

In [45]:
help(pd.DataFrame.drop)   # 모르는 함수가 있는데 인터넷이 안되면 -> help(함수) 로 확인

Help on function drop in module pandas.core.frame:

drop(self, labels=None, axis=0, index=None, columns=None, level=None, inplace=False, errors='raise')
    Drop specified labels from rows or columns.

    Remove rows or columns by specifying label names and corresponding
    axis, or by specifying directly index or column names. When using a
    multi-index, labels on different levels can be removed by specifying
    the level.

    Parameters
    ----------
    labels : single label or list-like
        Index or column labels to drop.
    axis : {0 or 'index', 1 or 'columns'}, default 0
        Whether to drop labels from the index (0 or 'index') or
        columns (1 or 'columns').
    index, columns : single label or list-like
        Alternative to specifying axis (``labels, axis=1``
        is equivalent to ``columns=labels``).

        .. versionadded:: 0.21.0
    level : int or level name, optional
        For MultiIndex, level from which the labels will be removed.
    inplace : bool, default False
        If True, do operation inplace and return None.
    errors : {'ignore', 'raise'}, default 'raise'
        If 'ignore', suppress error and only existing labels are
        dropped.

    Returns
    -------
    dropped : pandas.DataFrame

    Raises
    ------
    KeyError
        If none of the labels are found in the selected axis

    See Also
    --------
    DataFrame.loc : Label-location based indexer for selection by label.
    DataFrame.dropna : Return DataFrame with labels on given axis omitted
        where (all or any) data are missing.
    DataFrame.drop_duplicates : Return DataFrame with duplicate rows
        removed, optionally only considering certain columns.
    Series.drop : Return Series with specified index labels removed.

    Examples
    --------
    >>> df = pd.DataFrame(np.arange(12).reshape(3,4),
    ...                   columns=['A', 'B', 'C', 'D'])
    >>> df
       A  B   C   D
    0  0  1   2   3
    1  4  5   6   7
    2  8  9  10  11

    Drop columns

    >>> df.drop(['B', 'C'], axis=1)
       A   D
    0  0   3
    1  4   7
    2  8  11

    >>> df.drop(columns=['B', 'C'])
       A   D
    0  0   3
    1  4   7
    2  8  11

    Drop a row by index

    >>> df.drop([0, 1])
       A  B   C   D
    2  8  9  10  11

    Drop columns and/or rows of MultiIndex DataFrame

    >>> midx = pd.MultiIndex(levels=[['lama', 'cow', 'falcon'],
    ...                              ['speed', 'weight', 'length']],
    ...                      codes=[[0, 0, 0, 1, 1, 1, 2, 2, 2],
    ...                             [0, 1, 2, 0, 1, 2, 0, 1, 2]])
    >>> df = pd.DataFrame(index=midx, columns=['big', 'small'],
    ...                   data=[[45, 30], [200, 100], [1.5, 1], [30, 20],
    ...                         [250, 150], [1.5, 0.8], [320, 250],
    ...                         [1, 0.8], [0.3,0.2]])
    >>> df
                    big     small
    lama    speed   45.0    30.0
            weight  200.0   100.0
            length  1.5     1.0
    cow     speed   30.0    20.0
            weight  250.0   150.0
            length  1.5     0.8
    falcon  speed   320.0   250.0
            weight  1.0     0.8
            length  0.3     0.2

    >>> df.drop(index='cow', columns='small')
                    big
    lama    speed   45.0
            weight  200.0
            length  1.5
    falcon  speed   320.0
            weight  1.0
            length  0.3

    >>> df.drop(index='length', level=1)
                    big     small
    lama    speed   45.0    30.0
            weight  200.0   100.0
    cow     speed   30.0    20.0
            weight  250.0   150.0
    falcon  speed   320.0   250.0
            weight  1.0     0.8

In [46]:
'''
    삭제한 DataFrame을 저장하지 않으므로
    현재 결과값에서는 삭제된것처럼 보이나
    df2에 삭제한 결과가 저장되지 않음에 주의
'''
# 행 삭제
df2.drop(pd.to_datetime('2019-05-06'))     # 데이터프레임.drop(레이블)

               A전자     B화학     C금융     D엔터    E텔레콤    F소프트
2019-05-01  1000.0  2000.0  3000.0  4000.0  1000.0  1000.0
2019-05-02  1010.0  2010.0  3010.0  4010.0  1010.0  1010.0
2019-05-03  1020.0  2020.0  3020.0  4020.0  1020.0  1020.0
2019-05-04     NaN     NaN     NaN     NaN     NaN  1030.0
2019-05-07  1060.0  2060.0  3060.0  4060.0  1060.0  1060.0

In [47]:
df2.drop([pd.to_datetime('2019-05-02'), pd.to_datetime('2019-05-06')])     # 여러 행 삭제

               A전자     B화학     C금융     D엔터    E텔레콤    F소프트
2019-05-01  1000.0  2000.0  3000.0  4000.0  1000.0  1000.0
2019-05-03  1020.0  2020.0  3020.0  4020.0  1020.0  1020.0
2019-05-04     NaN     NaN     NaN     NaN     NaN  1030.0
2019-05-07  1060.0  2060.0  3060.0  4060.0  1060.0  1060.0

In [48]:
df2.drop('D엔터', axis=1)     # 열 삭제

               A전자     B화학     C금융    E텔레콤    F소프트
2019-05-01  1000.0  2000.0  3000.0  1000.0  1000.0
2019-05-02  1010.0  2010.0  3010.0  1010.0  1010.0
2019-05-03  1020.0  2020.0  3020.0  1020.0  1020.0
2019-05-04     NaN     NaN     NaN     NaN  1030.0
2019-05-06  1050.0  2050.0  3050.0  1050.0  1050.0
2019-05-07  1060.0  2060.0  3060.0  1060.0  1060.0

In [49]:
df2.drop(['C금융', 'E텔레콤'], axis=1)

               A전자     B화학     D엔터    F소프트
2019-05-01  1000.0  2000.0  4000.0  1000.0
2019-05-02  1010.0  2010.0  4010.0  1010.0
2019-05-03  1020.0  2020.0  4020.0  1020.0
2019-05-04     NaN     NaN     NaN  1030.0
2019-05-06  1050.0  2050.0  4050.0  1050.0
2019-05-07  1060.0  2060.0  4060.0  1060.0

데이터프레임 조회 및 슬라이싱

In [50]:
df2.head(3)     # DataFrame의 최초 5줄 조회

               A전자     B화학     C금융     D엔터    E텔레콤    F소프트
2019-05-01  1000.0  2000.0  3000.0  4000.0  1000.0  1000.0
2019-05-02  1010.0  2010.0  3010.0  4010.0  1010.0  1010.0
2019-05-03  1020.0  2020.0  3020.0  4020.0  1020.0  1020.0

In [51]:
df2.tail(3)     # DataFrame의 마지막 3줄 조회

               A전자     B화학     C금융     D엔터    E텔레콤    F소프트
2019-05-04     NaN     NaN     NaN     NaN     NaN  1030.0
2019-05-06  1050.0  2050.0  3050.0  4050.0  1050.0  1050.0
2019-05-07  1060.0  2060.0  3060.0  4060.0  1060.0  1060.0

In [52]:
df2.iloc[2]     # 인덱스 위치번호(iloc: Index Location)로 슬라이싱

A전자     1020.0
B화학     2020.0
C금융     3020.0
D엔터     4020.0
E텔레콤    1020.0
F소프트    1020.0
Name: 2019-05-03 00:00:00, dtype: float64

In [53]:
df2.loc['2019-05-03']     # 인덱스 이름으로 슬라이싱 시 iloc 대신 loc 사용

A전자     1020.0
B화학     2020.0
C금융     3020.0
D엔터     4020.0
E텔레콤    1020.0
F소프트    1020.0
Name: 2019-05-03 00:00:00, dtype: float64

In [54]:
df2.iloc[1:3]     # 여러 행 선택

               A전자     B화학     C금융     D엔터    E텔레콤    F소프트
2019-05-02  1010.0  2010.0  3010.0  4010.0  1010.0  1010.0
2019-05-03  1020.0  2020.0  3020.0  4020.0  1020.0  1020.0

In [55]:
df2.loc['2019-05-02':'2019-05-03']     # 행 다중 선택

               A전자     B화학     C금융     D엔터    E텔레콤    F소프트
2019-05-02  1010.0  2010.0  3010.0  4010.0  1010.0  1010.0
2019-05-03  1020.0  2020.0  3020.0  4020.0  1020.0  1020.0

In [56]:
df2[1:3]     # 행 다중 선택

               A전자     B화학     C금융     D엔터    E텔레콤    F소프트
2019-05-02  1010.0  2010.0  3010.0  4010.0  1010.0  1010.0
2019-05-03  1020.0  2020.0  3020.0  4020.0  1020.0  1020.0

In [57]:
df2['C금융']    # 열 슬라이싱은 열 이름으로 가능

2019-05-01    3000.0
2019-05-02    3010.0
2019-05-03    3020.0
2019-05-04       NaN
2019-05-06    3050.0
2019-05-07    3060.0
Name: C금융, dtype: float64

In [58]:
df2.iloc[1:3, 2]     # 위치 번호로 행, 열 선택

2019-05-02    3010.0
2019-05-03    3020.0
Name: C금융, dtype: float64

In [59]:
df2.loc['2019-05-02':'2019-05-03', 'C금융']    # 이름으로 행, 열 선택

2019-05-02    3010.0
2019-05-03    3020.0
Name: C금융, dtype: float64

In [60]:
# DataFrame의 스칼라 연산
df2['E텔레콤'] * 10     # 불러온 값 전체에 동일한 연산 수행

2019-05-01    10000.0
2019-05-02    10100.0
2019-05-03    10200.0
2019-05-04        NaN
2019-05-06    10500.0
2019-05-07    10600.0
Name: E텔레콤, dtype: float64

In [61]:
df2.sum(axis=0)     # 행간 연산, 즉 열별 합산

A전자      5140.0
B화학     10140.0
C금융     15140.0
D엔터     20140.0
E텔레콤     5140.0
F소프트     6170.0
dtype: float64

In [62]:
df2.median(axis=1)     # 열간 연산, 즉 행별 합산

2019-05-01    1500.0
2019-05-02    1510.0
2019-05-03    1520.0
2019-05-04    1030.0
2019-05-06    1550.0
2019-05-07    1560.0
dtype: float64

In [63]:
df2.describe()     # 통계 요약

,A전자,B화학,C금융,D엔터,E텔레콤,F소프트
count,5.000000,5.000000,5.000000,5.000000,5.000000,6.000000
mean,1028.000000,2028.000000,3028.000000,4028.000000,1028.000000,1028.333333
std,25.884358,25.884358,25.884358,25.884358,25.884358,23.166067
min,1000.000000,2000.000000,3000.000000,4000.000000,1000.000000,1000.000000
25%,1010.000000,2010.000000,3010.000000,4010.000000,1010.000000,1012.500000
50%,1020.000000,2020.000000,3020.000000,4020.000000,1020.000000,1025.000000
75%,1050.000000,2050.000000,3050.000000,4050.000000,1050.000000,1045.000000
max,1060.000000,2060.000000,3060.000000,4060.000000,1060.000000,1060.000000

보간법 - 구멍 메우기

In [64]:
df2

               A전자     B화학     C금융     D엔터    E텔레콤    F소프트
2019-05-01  1000.0  2000.0  3000.0  4000.0  1000.0  1000.0
2019-05-02  1010.0  2010.0  3010.0  4010.0  1010.0  1010.0
2019-05-03  1020.0  2020.0  3020.0  4020.0  1020.0  1020.0
2019-05-04     NaN     NaN     NaN     NaN     NaN  1030.0
2019-05-06  1050.0  2050.0  3050.0  4050.0  1050.0  1050.0
2019-05-07  1060.0  2060.0  3060.0  4060.0  1060.0  1060.0

In [65]:
df2.dropna()     # NaN 제거

               A전자     B화학     C금융     D엔터    E텔레콤    F소프트
2019-05-01  1000.0  2000.0  3000.0  4000.0  1000.0  1000.0
2019-05-02  1010.0  2010.0  3010.0  4010.0  1010.0  1010.0
2019-05-03  1020.0  2020.0  3020.0  4020.0  1020.0  1020.0
2019-05-06  1050.0  2050.0  3050.0  4050.0  1050.0  1050.0
2019-05-07  1060.0  2060.0  3060.0  4060.0  1060.0  1060.0

In [66]:
df2.fillna(0)     # NaN을 0으로 바꿈

               A전자     B화학     C금융     D엔터    E텔레콤    F소프트
2019-05-01  1000.0  2000.0  3000.0  4000.0  1000.0  1000.0
2019-05-02  1010.0  2010.0  3010.0  4010.0  1010.0  1010.0
2019-05-03  1020.0  2020.0  3020.0  4020.0  1020.0  1020.0
2019-05-04     0.0     0.0     0.0     0.0     0.0  1030.0
2019-05-06  1050.0  2050.0  3050.0  4050.0  1050.0  1050.0
2019-05-07  1060.0  2060.0  3060.0  4060.0  1060.0  1060.0

In [67]:
df2.fillna(method='ffill')     # NaN을 앞의 값으로 채움

               A전자     B화학     C금융     D엔터    E텔레콤    F소프트
2019-05-01  1000.0  2000.0  3000.0  4000.0  1000.0  1000.0
2019-05-02  1010.0  2010.0  3010.0  4010.0  1010.0  1010.0
2019-05-03  1020.0  2020.0  3020.0  4020.0  1020.0  1020.0
2019-05-04  1020.0  2020.0  3020.0  4020.0  1020.0  1030.0
2019-05-06  1050.0  2050.0  3050.0  4050.0  1050.0  1050.0
2019-05-07  1060.0  2060.0  3060.0  4060.0  1060.0  1060.0

In [68]:
df2.fillna(method='bfill')     # NaN을 뒤의 값으로 채움

               A전자     B화학     C금융     D엔터    E텔레콤    F소프트
2019-05-01  1000.0  2000.0  3000.0  4000.0  1000.0  1000.0
2019-05-02  1010.0  2010.0  3010.0  4010.0  1010.0  1010.0
2019-05-03  1020.0  2020.0  3020.0  4020.0  1020.0  1020.0
2019-05-04  1050.0  2050.0  3050.0  4050.0  1050.0  1030.0
2019-05-06  1050.0  2050.0  3050.0  4050.0  1050.0  1050.0
2019-05-07  1060.0  2060.0  3060.0  4060.0  1060.0  1060.0